In [1]:
# Import dependenciesvvv
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from config import db_password
from splinter import Browser
from bs4 import BeautifulSoup as soup
from webdriver_manager.chrome import ChromeDriverManager

In [2]:
# Load movie dataset
file_path = "movies.csv"
movies_df = pd.read_csv(file_path)
movies_df.head()

,name,rating,genre,year,released,score,votes,director,writer,star,country,budget,gross,company,runtime
0,The Shining,R,Drama,1980,"June 13, 1980 (United States)",8.4,927000.0,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000.0,46998772.0,Warner Bros.,146.0
1,The Blue Lagoon,R,Adventure,1980,"July 2, 1980 (United States)",5.8,65000.0,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000.0,58853106.0,Columbia Pictures,104.0
2,Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980 (United States)",8.7,1200000.0,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000.0,538375067.0,Lucasfilm,124.0
3,Airplane!,PG,Comedy,1980,"July 2, 1980 (United States)",7.7,221000.0,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000.0,83453539.0,Paramount Pictures,88.0
4,Caddyshack,R,Comedy,1980,"July 25, 1980 (United States)",7.3,108000.0,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000.0,39846344.0,Orion Pictures,98.0

In [3]:
unique = movies_df['star'].unique()
name_unique = pd.Series(unique).astype('str')
name_unique = name_unique.replace({" ":"_"}, regex=True)
name_unique

0         Jack_Nicholson
1         Brooke_Shields
2            Mark_Hamill
3            Robert_Hays
4            Chevy_Chase
              ...
2810      Billy_Hartmann
2811        Shannon_Bond
2812        Onyama_Laura
2813       Christina_Roz
2814    Siyabonga_Mabaso
Length: 2815, dtype: object

In [16]:
# Set up Splinter

executable_path = {'executable_path': ChromeDriverManager().install()}
browser = Browser('chrome', **executable_path, headless=False)

====== WebDriver manager ======
Current google-chrome version is 101.0.4951
Get LATEST chromedriver version for 101.0.4951 google-chrome
Driver [C:\Users\dhyde\.wdm\drivers\chromedriver\win32\101.0.4951.41\chromedriver.exe] found in cache

In [ ]:
# # Visit the filmsite.org page 
# url = 'https://en.wikipedia.org/wiki/Main_Page'
# browser.visit(url)

# # Optional delay for loading page
# browser.is_element_present_by_css('div.list_text', wait_time=1)

In [ ]:
# # Parse the HTML
# html = browser.html
# html_soup = soup(html, 'html.parser')

In [5]:
bday_list = []

In [6]:
# loop through wiki
for name in name_unique:
    url = 'https://en.wikipedia.org/wiki/' + name
    browser.visit(url)
    browser.is_element_present_by_css('div.list_text', wait_time=1)
    html = browser.html
    html_soup = soup(html, 'html.parser')
    try:
        bday = html_soup.find("span", {"class":"bday"}).string
    except:
        bday = "exception"
    bday_list.append(bday)

In [8]:
actor_bday = pd.DataFrame({"actor": name_unique,
                          "bday": bday_list})
actor_bday.head()

            actor        bday
0  Jack_Nicholson  1937-04-22
1  Brooke_Shields  1965-05-31
2     Mark_Hamill  1951-09-25
3     Robert_Hays  1947-07-24
4     Chevy_Chase  1943-10-08

In [10]:
lost_bday = actor_bday.loc[actor_bday["bday"] == "exception", :]
lost_bday.head()

               actor       bday
11             N!xau  exception
16       Eddie_Barth  exception
33       Scott_Glenn  exception
37  Laurence_Olivier  exception
52        Tim_Conway  exception

In [13]:
lost_name = pd.DataFrame(lost_bday)
lost_name.head()

               actor       bday                actor_name
11             N!xau  exception             N!xau_(actor)
16       Eddie_Barth  exception       Eddie_Barth_(actor)
33       Scott_Glenn  exception       Scott_Glenn_(actor)
37  Laurence_Olivier  exception  Laurence_Olivier_(actor)
52        Tim_Conway  exception        Tim_Conway_(actor)

In [14]:
for x in lost_name:
    lost_name["actor_name"] = lost_name["actor"] + "_(actor)"
lost_name.head()

               actor       bday                actor_name
11             N!xau  exception             N!xau_(actor)
16       Eddie_Barth  exception       Eddie_Barth_(actor)
33       Scott_Glenn  exception       Scott_Glenn_(actor)
37  Laurence_Olivier  exception  Laurence_Olivier_(actor)
52        Tim_Conway  exception        Tim_Conway_(actor)

In [24]:
new_bday_list = []

In [25]:
# loop through wiki
for name in lost_name["actor_name"]:
    url = 'https://en.wikipedia.org/wiki/' + name
    browser.visit(url)
    browser.is_element_present_by_css('div.list_text', wait_time=1)
    html = browser.html
    html_soup = soup(html, 'html.parser')
    try:
        new_bday = html_soup.find("span", {"class":"bday"}).string
    except:
        new_bday = "exception"
    new_bday_list.append(new_bday)

In [26]:
fixed_actor_bday = pd.DataFrame({"actor": actor_bday.loc[actor_bday["bday"] == "exception", "actor"],
                          "bday": new_bday_list})
fixed_actor_bday.head()

               actor       bday
11             N!xau  exception
16       Eddie_Barth  exception
33       Scott_Glenn  exception
37  Laurence_Olivier  exception
52        Tim_Conway  exception

In [27]:
fixed_actor_bday.nunique()

actor    407
bday      82
dtype: int64

In [52]:
actor_bday1 = actor_bday
fixed_actor_bday1 = fixed_actor_bday

In [62]:
# Create copy dataframes and replace "exception" with NaN in order to use the .combine_first function
actor_bday1["bday"].replace("exception", np.NaN, inplace=True)
actor_bday1.head(30)

                 actor        bday
0       Jack_Nicholson  1937-04-22
1       Brooke_Shields  1965-05-31
2          Mark_Hamill  1951-09-25
3          Robert_Hays  1947-07-24
4          Chevy_Chase  1943-10-08
5         Betsy_Palmer  1926-11-01
6         John_Belushi  1949-01-24
7       Robert_De_Niro  1943-08-17
8         Gene_Hackman  1930-01-30
9      David_Carradine  1936-12-08
10      Clint_Eastwood  1930-05-31
11               N!xau         NaN
12      Robin_Williams  1951-07-21
13   Donald_Sutherland  1935-07-17
14       Michael_Caine  1933-03-14
15   Christopher_Reeve  1952-09-25
16         Eddie_Barth         NaN
17          Jane_Fonda  1937-12-21
18    Adrienne_Barbeau  1945-06-11
19         Gene_Wilder  1933-06-11
20           Al_Pacino  1940-04-25
21  Kris_Kristofferson  1936-06-22
22        Kirk_Douglas  1916-12-09
23  Olivia_Newton-John  1948-09-26
24       John_Travolta  1954-02-18
25        William_Hurt  1950-03-20
26        Tatum_O'Neal  1963-11-05
27       Jason_Robards  1922-07-26
28      Robert_Redford  1936-08-18
29        Richard_Gere  1949-08-31

In [63]:
fixed_actor_bday1["bday"].replace("exception", np.NaN, inplace=True)
fixed_actor_bday1.head(30)

                     actor        bday
11                   N!xau         NaN
16             Eddie_Barth         NaN
33             Scott_Glenn         NaN
37        Laurence_Olivier         NaN
52              Tim_Conway         NaN
74         David_N._Haynes         NaN
127            Paul_Kelman         NaN
128     Elizabeth_Berridge         NaN
134         Nell_Schofield         NaN
135          Kristen_Riter         NaN
136  Wilhelmenia_Fernandez         NaN
139        George_Hamilton  1939-08-12
148           Leonard_Mann  1947-03-01
161            John_Savage  1949-08-25
182            Bertil_Guve         NaN
184             Tom_Atkins  1935-11-13
189        Peter_Gallagher         NaN
197            James_Olson         NaN
224            Toni_Attell         NaN
233         Teresa_Stratas         NaN
239      Elizabeth_Edmonds         NaN
240         Bill_Schoppert         NaN
253            David_Knell         NaN
266           Randy_Norton         NaN
274         Peter_Keleghan         NaN
284           Tony_Roberts  1939-10-22
289           Mark_Gregory  1964-05-02
296            David_Keith  1954-05-08
308            Martin_Yost         NaN
318          Everett_Silas         NaN

In [64]:
# Try to replace the exception values with date values from fixed_actor_bday list where possible
merged_actor = actor_bday1.combine_first(fixed_actor_bday1)
merged_actor

                 actor        bday
0       Jack_Nicholson  1937-04-22
1       Brooke_Shields  1965-05-31
2          Mark_Hamill  1951-09-25
3          Robert_Hays  1947-07-24
4          Chevy_Chase  1943-10-08
...                ...         ...
2810    Billy_Hartmann         NaN
2811      Shannon_Bond         NaN
2812      Onyama_Laura  1992-10-14
2813     Christina_Roz         NaN
2814  Siyabonga_Mabaso         NaN

[2815 rows x 2 columns]

In [65]:
# Check a known 'exception' value to see if it merged correctly
merged_actor.loc[merged_actor["actor"] == "Adam_Scott", :]

           actor        bday
2484  Adam_Scott  1973-04-03

In [68]:
# Reformat actor names
names = merged_actor["actor"]
names = names.replace({"_":" "}, regex=True)
names

0         Jack Nicholson
1         Brooke Shields
2            Mark Hamill
3            Robert Hays
4            Chevy Chase
              ...
2810      Billy Hartmann
2811        Shannon Bond
2812        Onyama Laura
2813       Christina Roz
2814    Siyabonga Mabaso
Name: actor, Length: 2815, dtype: object

In [70]:
clean_actor = pd.DataFrame({"actor": names, "bday": merged_actor["bday"]})
clean_actor.head(30)

                 actor        bday
0       Jack Nicholson  1937-04-22
1       Brooke Shields  1965-05-31
2          Mark Hamill  1951-09-25
3          Robert Hays  1947-07-24
4          Chevy Chase  1943-10-08
5         Betsy Palmer  1926-11-01
6         John Belushi  1949-01-24
7       Robert De Niro  1943-08-17
8         Gene Hackman  1930-01-30
9      David Carradine  1936-12-08
10      Clint Eastwood  1930-05-31
11               N!xau         NaN
12      Robin Williams  1951-07-21
13   Donald Sutherland  1935-07-17
14       Michael Caine  1933-03-14
15   Christopher Reeve  1952-09-25
16         Eddie Barth         NaN
17          Jane Fonda  1937-12-21
18    Adrienne Barbeau  1945-06-11
19         Gene Wilder  1933-06-11
20           Al Pacino  1940-04-25
21  Kris Kristofferson  1936-06-22
22        Kirk Douglas  1916-12-09
23  Olivia Newton-John  1948-09-26
24       John Travolta  1954-02-18
25        William Hurt  1950-03-20
26        Tatum O'Neal  1963-11-05
27       Jason Robards  1922-07-26
28      Robert Redford  1936-08-18
29        Richard Gere  1949-08-31

In [71]:
# Connection string to PostgreSQL
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/group_project"

In [72]:
# Create database engine
engine = create_engine(db_string)

In [73]:
# Export actor awards to a SQL table
clean_actor.to_sql(name="actor_bday", con=engine, if_exists='replace', index=False)

In [74]:
browser.quit()